app/controllers/toppage_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def top
    debugger
    @user = UserSession.find.user