app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `login`, `last_login_at`) VALUES('2010-08-16 09:34:14', 'f375acd49d44d3ee86d0c225b968c36b0066c10754edcb30f38d9933cae09a664cf06c9bf9906a09fa5fe0a9ff29243f488f9b341f30d17cf49817bcd88f827a', '2010-08-16 09:34:14', 'sVSe6RShj8VDAiVnyZFU', '2010-08-16 09:34:14', '8cab74e312161dd44ad456922ba1acbddd4256c0e0f0400961d8a55c602e075667fd10bc6f3d721f9163349eca7b3dde632b8159e3b2ec5ca58e487f48ed7023', 1, 'aaaa', NULL)
---
  def create
    debugger
    @user = User.new(params[:user])
    if @user.save